[
    {
        "title": "Microbiome RAG-Chatbot",
        "year": "2025",
        "image": "../images/microbiome.jpg",
        "description": "Built a RAG-based chatbot using ChromaDB, LlamaIndex, and LangChain, enabling natural language queries of large-scale microbiome datasets for scientific research"
    },
    {
        "title": "Trip Itinerary Optimizer",
        "year": "2025",
        "image": "../images/trip.jpg",
        "description": "Developed a full-stack travel itinerary application using Next.js, TypeScript, and Firebase, incorporating interactive maps with Mapbox API, real-time weather data via OpenWeatherMap, and OpenAI API for finding optimal routes and summarization"
    },
    {
        "title": "Predictive Modeling of Cooking Times",
        "year": "2025",
        "image": "../images/cooking.jpg",
        "description": "Conducted extensive data analysis on 83,000+ recipes using Python to investigate correlations between nutritional factors and cooking duration, employing feature engineering (polynomial features, quantile transformation) and ML techniques (KNN Regression, Random Forest, Gradient Boosting) to develop a predictive model that achieved 77% variance explanation (R²) with RMSE improvement of 50.6% over baseline."
    },
    {
        "title": "Lunar Calendar Web App",
        "year": "2024",
        "image": "../images/lunar.png",
        "description": "Developed a MERN-stack app using the NASA APOD API for users to learn more about different lunar phases"
    },
    {
        "title": "Predicting Housing Prices in Boston",
        "year": "2024",
        "image": "../images/boston.jpg",
        "description": "Linear regression project using scikit-learn that predicts housing prices in the suburbs of Boston"
    },
    {
        "title": "SDSC Internship Project",
        "year": "2024",
        "image": "../images/sdsc.jpg",
        "description": "Developed a full-stack web application, LegalLens, with a terms and contract analytics dashboard powered by OpenAI API"
    },
    {
        "title": "TripAdvisor Hotel Rating Prediction App",
        "year": "2023",
        "image": "../images/trip-advisor.jpg",
        "description": "Built a Python NLP pipeline for sentiment analysis on 20,000+ TripAdvisor reviews, categorizing hotel ratings for better insights. Integrated NLP model into a Flask and JavaScript based web platform"
    },
    {
        "title": "Scalable AI Pipeline for Microbiome Web Scraping",
        "year": "2025",
        "image": "../images/microbiome2.jpg",
        "description": "Built a scalable AI pipeline using Meta’s Code Llama, AutoGPT, and OpenAI API to automate bioinformatics web scraping and metadata extraction from microbiome research databases. The system continuously gathers, cleans, and structures study metadata, streamlining data analysis for large-scale microbiome research"
    },
    {
        "title": "Machine Learning Research Platform",
        "year": "2025",
        "image": "../images/ml.jpg",
        "description": "Developed and deployed a full-stack machine learning research platform using React, FastAPI, Docker, and AWS, supporting 100+ dataset uploads and 50+ concurrent training jobs. Achieved 99.9% uptime and reduced training latency by 40% through asynchronous job handling with Celery and Redis, integrated with EC2, S3, and RDS."
    },
    {
        "title": "Personal Portfolio Website",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Personal portfolio website with animations and interactive elements built with Next.js and Tailwind CSS"
    },
    {
        "title": "N-Gram Language Models",
        "year": "2024",
        "image": "../images/ngram.png",
        "description": "Web scraped data from Gutenberg and tokenized input to build N-Gram language models."
    },
    {
        "title": "Taylor Swift Song Recommender",
        "year": "2023",
        "image": "../images/tswift.jpg",
        "description": "Build a recommender system using Taylor Swift's music and performed TF-IDF to extract important keywords. Used sentiment analysis to understand overall music tone and an algorithm to suggest songs with similar sentiment."
    }
]